import { DEV_USER_IDS } from "@/utils/permissionSettings";

/** 管理层 */
const R1 = [
  // Nikki总
  "1926449443739601215",
  // 杨总
  "1926449443739598912",
  // 大树总
  "1870023775338692610",
  // 李总
  "1871107779173351425",
  // 陈董
  "1926449443739598857",
  // Lucy
  "1869688287188811777"
];

/** 业务角色 */
const R2 = [
  // 蔡笑笑
  "1909905227809075202",
  // 肖嘉玲
  "1869635118983348225",
  // 刘艺菲
  "1872322304658681857",
  // 侯子洋
  "1874737838738157569",
  // 董晟
  "1926449443739601498",
  // 庄惠玲
  "1887419131254845441",
  // 杨佳
  "1926449443739601499",
  // 席珍珍
  "1926449443739598856",
  // 单春元
  "1893860783196516354",
  // 华天娇
  "1889620995820007426",
  // 王静瑶
  "1877604460226195458",
  // 修一平
  "1926449443739601545",
  // 王思宇
  "1905161341983305730",
  // 徐小佑
  "1880116642318954498",
  // 陈瑶
  "1901460060580130818",
  // 蒋思琳
  "1926449443739598892",
  // 陈金池
  "1875104738458513409",
  // 沈烨丽
  "1871811193805012994",
  // 叶挺
  "1926449443739598853",
  // 林纤纤
  "1897131039436353538",
  // 董思萍
  "1901573877226057730",
  // 黄琳艳
  "1926449443739598850",
  // 徐小洁
  "1874737276248436737",
  // 周霖红
  "1926449443739598909"
];

/** 设计师本人 */
const R3 = [
  // 黄文文
  "1874747823371104257",
  // 尤俊力
  "1926449443739598914",
  // 夏筠
  "1926449443739601470"
];

export const Roles = { R1, R2, R3 };

// 判断是否有权限
export function hasManageBoardPermission(
  userId: string,
  idList: Array<string>
): boolean {
  // 判断idList里是否有userId
  if (idList.includes(userId)) {
    return true;
  }
  return false;
}

// 判断是否是管理员
export function isAdmin(userId: string): boolean {
  return DEV_USER_IDS.includes(userId);
}
